# **Convert JSON data into MySQL database (Step 3)**

In [2]:
import numpy as np
import pandas as pd

## **Connect the database to Azure and store the data**

In [3]:
from sqlalchemy import create_engine
!pip install PyMySql
import pymysql
import sqlalchemy
!pip install mysql-connector-python
import mysql.connector
!pip install mysqlclient

Collecting PyMySql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.4 MB/s eta 0:00:00
Installing collected packages: PyMySql
Successfully installed PyMySql-1.1.0
Collecting mysql-connector-python
  Downloading mysql_connector_python-8.2.0-cp310-cp310-manylinux_2_17_x86_64.whl (31.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 31.6/31.6 MB 49.8 MB/s eta 0:00:00
Collecting protobuf<=4.21.12,>=4.21.1 (from mysql-connector-python)
  Downloading protobuf-4.21.12-cp37-abi3-manylinux2014_x86_64.whl (409 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 409.8/409.8 kB 41.3 MB/s eta 0:00:00
Installing collected packages: protobuf, mysql-connector-python
  Attempting uninstall: protobuf
    Found existing installation: protobuf 3.20.3
    Uninstalling protobuf-3.20.3:
      Successfully uninstalled protobuf-3.20.3
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
tensorflow-metadata 1.14.0 requires protobuf<4.21,>=3.20.3, but you have protobuf 4.21.12 which is incompatible.
Successfully installed mysql-connector-python-8.2.0 protobuf-4.21.12
Collecting mysqlclient
  Downloading mysqlclient-2.2.0.tar.gz (89 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 89.5/89.5 kB 1.9 MB/s eta 0:00:00
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Installing backend dependencies ... done
  Preparing metadata (pyproject.toml) ... done
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (pyproject.toml) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.2.0-cp310-cp310-linux_x86_64.whl size=123673 sha256=a4404b926d3c568ab3b89bda3a8e4da95d524604cedf5f80d62783c8fab55d01
  Stored in directory: /root/.cache/pip/wheels/a4/f8/fd/0399687c0abd03c10c975ed56c692fcd3d0fb80440b5a661f1
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.0

In [4]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.22)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (67.7.2)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 20.4 MB/s eta 0:00:00
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.39)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.8)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Installing collected packages: jedi
Successfully installed jedi-0.19.1

In [5]:
username = 'A09' # Your team name
password = 'A09password'
host = 'testproject.mysql.database.azure.com'
database = 'A09'  # Your team name
connection_string = f"mysql+pymysql://{username}:{password}@{host}/{database}"

ssl_args = {
    'ssl_ca': 'path_to/ca-cert.pem',
    'ssl_cert': 'path_to/client-cert.pem',
    'ssl_key': 'path_to/client-key.pem'
}

engine = create_engine(
    connection_string,
    connect_args={'ssl': ssl_args}
)

In [6]:
%load_ext sql

In [7]:
%sql mysql://A09:A09password@testproject.mysql.database.azure.com:3306/A09

In [ ]:
%sql show databases

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
3 rows affected.

[('a09',), ('information_schema',), ('performance_schema',)]

In [ ]:
%sql use a09

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.

[]

In [ ]:
%sql SHOW TABLES;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
11 rows affected.

[('business',),
 ('business_attributes',),
 ('business_categories',),
 ('business_hours',),
 ('checkin',),
 ('review',),
 ('tip',),
 ('user',),
 ('user_compliments',),
 ('user_elite',),
 ('user_friends',)]

# **Make changes on table so it matches our expectation**

## **1: Separate categories from business table into business_categories**

In [ ]:
%%sql
# Drop the table if it exists
DROP TABLE IF EXISTS business_categories;

# Create a new table to store the split values
CREATE TABLE business_categories (
    business_id VARCHAR(255),
    business_category VARCHAR(255)
);

# Split the categories for each business_id
INSERT INTO business_categories (business_id, business_category)
SELECT
    b.business_id,
    TRIM(BOTH ',' FROM SUBSTRING_INDEX(SUBSTRING_INDEX(b.categories, ',', n.n), ',', -1)) AS business_category
FROM
    business b
JOIN (
    SELECT 1 + units.i + tens.i * 10 AS n
    FROM (
        SELECT 0 i UNION ALL SELECT 1 UNION ALL SELECT 2 UNION ALL SELECT 3 UNION ALL SELECT 4
        UNION ALL SELECT 5 UNION ALL SELECT 6 UNION ALL SELECT 7 UNION ALL SELECT 8 UNION ALL SELECT 9
    ) units
    JOIN (
        SELECT 0 i UNION ALL SELECT 1 UNION ALL SELECT 2 UNION ALL SELECT 3 UNION ALL SELECT 4
        UNION ALL SELECT 5 UNION ALL SELECT 6 UNION ALL SELECT 7 UNION ALL SELECT 8 UNION ALL SELECT 9
    ) tens
) n
ON CHAR_LENGTH(b.categories)
    -CHAR_LENGTH(REPLACE(b.categories, ',', '')) >= n.n - 1;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.
0 rows affected.
668592 rows affected.

[]

**After separation, drop the categories column in business table**

In [ ]:
%%sql
ALTER TABLE business DROP COLUMN categories;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.

[]

## **2: Separate attributes from business table into business_attributes**

In [ ]:
%%sql
# Drop the table if it exists
DROP TABLE IF EXISTS business_attributes;

# Create a new table to store the split values
CREATE TABLE business_attributes (
    business_id VARCHAR(255),
    business_attribute VARCHAR(255)
);

# Split the attributes for each business_id
INSERT INTO business_attributes (business_id, business_attribute)
SELECT
    b.business_id,
    TRIM(BOTH ',' FROM SUBSTRING_INDEX(SUBSTRING_INDEX(b.attributes, ',', n.n), ',', -1)) AS business_attribute
FROM
    business b
JOIN (
    SELECT 1 + units.i + tens.i * 10 AS n
    FROM (
        SELECT 0 i UNION ALL SELECT 1 UNION ALL SELECT 2 UNION ALL SELECT 3 UNION ALL SELECT 4
        UNION ALL SELECT 5 UNION ALL SELECT 6 UNION ALL SELECT 7 UNION ALL SELECT 8 UNION ALL SELECT 9
    ) units
    JOIN (
        SELECT 0 i UNION ALL SELECT 1 UNION ALL SELECT 2 UNION ALL SELECT 3 UNION ALL SELECT 4
        UNION ALL SELECT 5 UNION ALL SELECT 6 UNION ALL SELECT 7 UNION ALL SELECT 8 UNION ALL SELECT 9
    ) tens
) n
ON CHAR_LENGTH(b.attributes)
    -CHAR_LENGTH(REPLACE(b.attributes, ',', '')) >= n.n - 1;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.
0 rows affected.
2151634 rows affected.

[]

**After separation, drop the attributes column in business table**

In [ ]:
%%sql
ALTER TABLE business DROP COLUMN attributes;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.

[]

## **3: Separate elite from user table into user_elite**

In [ ]:
%%sql
# Drop the table if it exists
DROP TABLE IF EXISTS user_elite;

# Create a new table to store the split values
CREATE TABLE user_elite (
    user_id VARCHAR(255),
    elite VARCHAR(255)
);

# Split the categories for each business_id
INSERT INTO user_elite (user_id, elite)
SELECT
    u.user_id,
    TRIM(BOTH ',' FROM SUBSTRING_INDEX(SUBSTRING_INDEX(u.elite, ',', n.n), ',', -1)) AS elite
FROM
    user u
JOIN (
    SELECT 1 + units.i + tens.i * 10 AS n
    FROM (
        SELECT 0 i UNION ALL SELECT 1 UNION ALL SELECT 2 UNION ALL SELECT 3 UNION ALL SELECT 4
        UNION ALL SELECT 5 UNION ALL SELECT 6 UNION ALL SELECT 7 UNION ALL SELECT 8 UNION ALL SELECT 9
    ) units
    JOIN (
        SELECT 0 i UNION ALL SELECT 1 UNION ALL SELECT 2 UNION ALL SELECT 3 UNION ALL SELECT 4
        UNION ALL SELECT 5 UNION ALL SELECT 6 UNION ALL SELECT 7 UNION ALL SELECT 8 UNION ALL SELECT 9
    ) tens
) n
ON CHAR_LENGTH(u.elite)
    -CHAR_LENGTH(REPLACE(u.elite, ',', '')) >= n.n - 1;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.
0 rows affected.
2277195 rows affected.

[]

**After separation, drop the elite column in user table**

In [ ]:
%%sql
ALTER TABLE user DROP COLUMN elite;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.

[]

## **4: Separate friends from user table into user_friends**

In [ ]:
%%sql
# Drop the table if it exists
DROP TABLE IF EXISTS user_friends;

# Create a new table to store the split values
CREATE TABLE user_friends (
    user_id VARCHAR(255),
    friends VARCHAR(255)
);

# Split the categories for each business_id
INSERT INTO user_friends (user_id, friends)
SELECT
    u.user_id,
    TRIM(BOTH ',' FROM SUBSTRING_INDEX(SUBSTRING_INDEX(u.friends, ',', n.n), ',', -1)) AS friends
FROM
    user u
JOIN (
    SELECT 1 + units.i + tens.i * 10 AS n
    FROM (
        SELECT 0 i UNION ALL SELECT 1 UNION ALL SELECT 2 UNION ALL SELECT 3 UNION ALL SELECT 4
        UNION ALL SELECT 5 UNION ALL SELECT 6 UNION ALL SELECT 7 UNION ALL SELECT 8 UNION ALL SELECT 9
    ) units
    JOIN (
        SELECT 0 i UNION ALL SELECT 1 UNION ALL SELECT 2 UNION ALL SELECT 3 UNION ALL SELECT 4
        UNION ALL SELECT 5 UNION ALL SELECT 6 UNION ALL SELECT 7 UNION ALL SELECT 8 UNION ALL SELECT 9
    ) tens
) n
ON CHAR_LENGTH(u.friends)
    -CHAR_LENGTH(REPLACE(u.friends, ',', '')) >= n.n - 1;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.
0 rows affected.
10470714 rows affected.

[]

**After separation, drop the friends column in user table**

In [ ]:
%%sql
ALTER TABLE user DROP COLUMN friends;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.

[]

## **5: Separate compliment columns from user table into user_compliment**

In [ ]:
%%sql
# Drop the table if it exists
DROP TABLE IF EXISTS user_compliments;

# Create new table consists compliment columns
CREATE TABLE user_compliments (
    user_id VARCHAR(255),
    compliment_hot BIGINT,
    compliment_more BIGINT,
    compliment_profile BIGINT,
    compliment_cute BIGINT,
    compliment_list BIGINT,
    compliment_note BIGINT,
    compliment_plain BIGINT,
    compliment_cool BIGINT,
    compliment_funny BIGINT,
    compliment_writer BIGINT,
    compliment_photos BIGINT
);

#Copy the compliment columns and the associated user_id from the user table into the newly created user_compliments table
INSERT INTO user_compliments (
    user_id,
    compliment_hot,
    compliment_more,
    compliment_profile,
    compliment_cute,
    compliment_list,
    compliment_note,
    compliment_plain,
    compliment_cool,
    compliment_funny,
    compliment_writer,
    compliment_photos
)
SELECT
    user_id,
    compliment_hot,
    compliment_more,
    compliment_profile,
    compliment_cute,
    compliment_list,
    compliment_note,
    compliment_plain,
    compliment_cool,
    compliment_funny,
    compliment_writer,
    compliment_photos
FROM user;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.
0 rows affected.
1987897 rows affected.

[]

**After separation, drop the compliments column in user table**

In [ ]:
%%sql
ALTER TABLE user
DROP COLUMN compliment_hot,
DROP COLUMN compliment_more,
DROP COLUMN compliment_profile,
DROP COLUMN compliment_cute,
DROP COLUMN compliment_list,
DROP COLUMN compliment_note,
DROP COLUMN compliment_plain,
DROP COLUMN compliment_cool,
DROP COLUMN compliment_funny,
DROP COLUMN compliment_writer,
DROP COLUMN compliment_photos;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.

[]

## **6: Separate hours from business table into business_hours**

In [ ]:
 %%sql

# Drop the table if it exists
DROP TABLE IF EXISTS business_hours;

# Create a new table to store the split values
CREATE TABLE business_hours (
    business_id TEXT,
    day_of_week VARCHAR(50),
    open_time TIME,
    close_time TIME
);

# Split the hours for each business_id using MySQL's JSON functions
INSERT INTO business_hours (business_id, day_of_week, open_time, close_time)
SELECT
    b.business_id,
    day.day,
    TIME(SUBSTRING_INDEX(JSON_UNQUOTE(JSON_EXTRACT(b.hours, CONCAT('$."', day.day, '"'))), '-', 1)) AS open_time,
    TIME(SUBSTRING_INDEX(JSON_UNQUOTE(JSON_EXTRACT(b.hours, CONCAT('$."', day.day, '"'))), '-', -1)) AS close_time
FROM
    business b
    CROSS JOIN (
        SELECT 'Monday' AS day UNION ALL
        SELECT 'Tuesday' UNION ALL
        SELECT 'Wednesday' UNION ALL
        SELECT 'Thursday' UNION ALL
        SELECT 'Friday' UNION ALL
        SELECT 'Saturday' UNION ALL
        SELECT 'Sunday'
    ) AS day
WHERE
    JSON_EXTRACT(b.hours, CONCAT('$."', day.day, '"')) IS NOT NULL;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.
0 rows affected.
801015 rows affected.

[]

**After separation, drop the hours column in business table**

In [ ]:
%%sql
ALTER TABLE business DROP COLUMN hours;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.

[]

# **Set FK**

In [9]:
## I have made the change in Datagrip, which has dropped the my_row_id. So the output is error.
%%sql
USE a09;
ALTER TABLE business
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

ALTER TABLE user
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN user_id varchar(22) NOT NULL,
ADD PRIMARY KEY(user_id);

ALTER TABLE review
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN review_id varchar(22) NOT NULL,
ADD PRIMARY KEY(review_id);

ALTER TABLE user_compliments
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN user_id varchar(22) NOT NULL,
ADD PRIMARY KEY(user_id);

ALTER TABLE checkin
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
0 rows affected.
(MySQLdb.OperationalError) (1091, "Can't DROP 'my_row_id'; check that column/key exists")
[SQL: ALTER TABLE business
DROP PRIMARY KEY,
DROP COLUMN my_row_id,
MODIFY COLUMN business_id varchar(22) NOT NULL,
ADD PRIMARY KEY(business_id);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# **Show columns from each table for query preparation**

In [ ]:
%%sql
SHOW COLUMNS FROM business;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
13 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('index', 'bigint', 'YES', 'MUL', None, ''),
 ('business_id', 'text', 'YES', '', None, ''),
 ('name', 'text', 'YES', '', None, ''),
 ('address', 'text', 'YES', '', None, ''),
 ('city', 'text', 'YES', '', None, ''),
 ('state', 'text', 'YES', '', None, ''),
 ('postal_code', 'text', 'YES', '', None, ''),
 ('latitude', 'double', 'YES', '', None, ''),
 ('longitude', 'double', 'YES', '', None, ''),
 ('stars', 'double', 'YES', '', None, ''),
 ('review_count', 'bigint', 'YES', '', None, ''),
 ('is_open', 'bigint', 'YES', '', None, '')]

In [ ]:
%%sql
SHOW COLUMNS FROM business_categories;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
3 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('business_id', 'varchar(255)', 'YES', '', None, ''),
 ('business_category', 'varchar(255)', 'YES', '', None, '')]

In [ ]:
%%sql
SHOW COLUMNS FROM business_attributes;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
3 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('business_id', 'varchar(255)', 'YES', '', None, ''),
 ('business_attribute', 'varchar(255)', 'YES', '', None, '')]

In [ ]:
%%sql
SHOW COLUMNS FROM business_hours;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
5 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('business_id', 'text', 'YES', '', None, ''),
 ('day_of_week', 'varchar(50)', 'YES', '', None, ''),
 ('open_time', 'time', 'YES', '', None, ''),
 ('close_time', 'time', 'YES', '', None, '')]

In [ ]:
%%sql
SHOW COLUMNS FROM checkin;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
4 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('index', 'bigint', 'YES', 'MUL', None, ''),
 ('business_id', 'text', 'YES', '', None, ''),
 ('date', 'text', 'YES', '', None, '')]

In [ ]:
%%sql
SHOW COLUMNS FROM review;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
11 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('index', 'bigint', 'YES', 'MUL', None, ''),
 ('review_id', 'text', 'YES', '', None, ''),
 ('user_id', 'text', 'YES', '', None, ''),
 ('business_id', 'text', 'YES', '', None, ''),
 ('stars', 'double', 'YES', '', None, ''),
 ('useful', 'bigint', 'YES', '', None, ''),
 ('funny', 'bigint', 'YES', '', None, ''),
 ('cool', 'bigint', 'YES', '', None, ''),
 ('text', 'text', 'YES', '', None, ''),
 ('date', 'text', 'YES', '', None, '')]

In [ ]:
%%sql
SHOW COLUMNS FROM tip;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
7 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('index', 'bigint', 'YES', 'MUL', None, ''),
 ('user_id', 'text', 'YES', '', None, ''),
 ('business_id', 'text', 'YES', '', None, ''),
 ('text', 'text', 'YES', '', None, ''),
 ('date', 'text', 'YES', '', None, ''),
 ('compliment_count', 'bigint', 'YES', '', None, '')]

In [ ]:
%%sql
SHOW COLUMNS FROM user;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
11 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('index', 'bigint', 'YES', 'MUL', None, ''),
 ('user_id', 'text', 'YES', '', None, ''),
 ('name', 'text', 'YES', '', None, ''),
 ('review_count', 'bigint', 'YES', '', None, ''),
 ('yelping_since', 'text', 'YES', '', None, ''),
 ('useful', 'bigint', 'YES', '', None, ''),
 ('funny', 'bigint', 'YES', '', None, ''),
 ('cool', 'bigint', 'YES', '', None, ''),
 ('fans', 'bigint', 'YES', '', None, ''),
 ('average_stars', 'double', 'YES', '', None, '')]

In [ ]:
%%sql
SHOW COLUMNS FROM user_compliments;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
13 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('user_id', 'varchar(255)', 'YES', '', None, ''),
 ('compliment_hot', 'bigint', 'YES', '', None, ''),
 ('compliment_more', 'bigint', 'YES', '', None, ''),
 ('compliment_profile', 'bigint', 'YES', '', None, ''),
 ('compliment_cute', 'bigint', 'YES', '', None, ''),
 ('compliment_list', 'bigint', 'YES', '', None, ''),
 ('compliment_note', 'bigint', 'YES', '', None, ''),
 ('compliment_plain', 'bigint', 'YES', '', None, ''),
 ('compliment_cool', 'bigint', 'YES', '', None, ''),
 ('compliment_funny', 'bigint', 'YES', '', None, ''),
 ('compliment_writer', 'bigint', 'YES', '', None, ''),
 ('compliment_photos', 'bigint', 'YES', '', None, '')]

In [ ]:
%%sql
SHOW COLUMNS FROM user_elite;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
3 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('user_id', 'varchar(255)', 'YES', '', None, ''),
 ('elite', 'varchar(255)', 'YES', '', None, '')]

In [ ]:
%%sql
SHOW COLUMNS FROM user_friends;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
3 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('user_id', 'varchar(255)', 'YES', '', None, ''),
 ('friends', 'varchar(255)', 'YES', '', None, '')]

# **10 queries on the yelp data which help start a new restaurant in Philadelphia (Step 4)**

## **Query 1: Most Popular Types of Restaurants in Philadelphia**

Business meaning: Identifying the most popular type of restaurant gives an indication of the current market demand. Knowing what customers in Philadelphia prefer can help us align the restaurant concept with the tastes and preferences of the local clientele.

In [ ]:
%%sql
SELECT bc.business_category, COUNT(bc.business_id) AS count
FROM business_categories bc
JOIN business b ON bc.business_id = b.business_id
WHERE b.city = 'Philadelphia' AND bc.business_category != 'Restaurants' AND EXISTS (
    SELECT 1 FROM business_categories bc2
    WHERE bc2.business_id = b.business_id AND bc2.business_category = 'Restaurants'
)
GROUP BY bc.business_category
ORDER BY count DESC
LIMIT 10;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
10 rows affected.

[(' Food', 367),
 (' Pizza', 277),
 (' Sandwiches', 219),
 (' Nightlife', 191),
 (' American (New)', 190),
 (' Bars', 178),
 (' Chinese', 172),
 (' Breakfast & Brunch', 159),
 (' Italian', 150),
 (' American (Traditional)', 123)]

## **Query 2: Average ratings of most popular restaurants in Philadelphia**

Business meaning: The average rating sets a standard for new entrants, indicating the level of service and quality they need to achieve or surpass to compete effectively with well-established and favored restaurants.

In [ ]:
%%sql
SELECT
    b.name AS Restaurant_Name,
    AVG(b.stars) AS Average_Rating,
    SUM(b.review_count) AS Total_Reviews
FROM
    business b
INNER JOIN
    business_categories bc ON b.business_id = bc.business_id
WHERE
    b.city = 'Philadelphia'
    AND bc.business_category = 'Restaurants'
GROUP BY
    b.name
ORDER BY
    Total_Reviews DESC,
    Average_Rating DESC
LIMIT 10;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
10 rows affected.

[('Green Eggs Café', 3.8333333333333335, Decimal('3650')),
 ('Parc', 4.0, Decimal('2761')),
 ("Tommy DiNic's", 4.0, Decimal('2221')),
 ('Buddakan', 4.0, Decimal('1561')),
 ('Vedge', 4.5, Decimal('1447')),
 ('Oyster House', 4.0, Decimal('1407')),
 ('Butcher and Singer', 4.5, Decimal('1290')),
 ("Little Nonna's", 4.0, Decimal('1147')),
 ("Gran Caffe L'Aquila", 4.5, Decimal('1138')),
 ('Chubby Cattle', 4.5, Decimal('1128'))]

## **Query 3: Most reviewed 10 Restaurants in Philadelphia**

Business meaning: Wanting to know the most reviewed 10 restaurants in Philadelphia provides insight into which establishments are drawing the most attention and engagement from customers. High numbers of reviews typically indicate strong customer footfall and experience sharing.

In [ ]:
%%sql
SELECT
    b.name AS Restaurant_Name,
    b.review_count AS Total_Reviews
FROM
    business b
INNER JOIN
    business_categories bc ON b.business_id = bc.business_id
WHERE
    b.city = 'Philadelphia'
    AND bc.business_category = 'Restaurants'
ORDER BY
    b.review_count DESC
LIMIT 10;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
10 rows affected.

[('Parc', 2761),
 ('Green Eggs Café', 2679),
 ("Tommy DiNic's", 2221),
 ('Buddakan', 1561),
 ('Vedge', 1447),
 ('Oyster House', 1407),
 ('Butcher and Singer', 1290),
 ("Little Nonna's", 1147),
 ("Gran Caffe L'Aquila", 1138),
 ('Chubby Cattle', 1128)]

## **Query 4: Count of Open and Closed Restaurants in Philadelphia**

Business meaning: Understanding the number of open restaurants can give us insight into how saturated the market is. A high number of open restaurants might indicate fierce competition, while a lower number could signify a potential opportunity.

In [ ]:
%%sql
SELECT
    CASE
        WHEN b.is_open = 1 THEN 'Open'
        ELSE 'Closed'
    END AS Restaurant_Status,
    COUNT(b.business_id) AS Total_Count
FROM
    business b
INNER JOIN
    business_categories bc ON b.business_id = bc.business_id
WHERE
    b.city = 'Philadelphia'
    AND bc.business_category = 'Restaurants'
GROUP BY
    b.is_open;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
2 rows affected.

[('Open', 1017), ('Closed', 715)]

## **Query 5: Average opening hours of Restaurants in Philadelphia**

Business meaning: The average opening hours can give insights into the dining habits and preferences of the local population. For instance, if most restaurants are open late, it might indicate that late-night dining or nightlife is popular. For a new restaurant, knowing the average opening hours can help in determining its own operational hours.

In [ ]:
%%sql
SELECT
    AVG(
        CASE
            WHEN close_time >= open_time THEN TIME_TO_SEC(TIMEDIFF(close_time, open_time))
            ELSE TIME_TO_SEC(TIMEDIFF('24:00:00', open_time)) + TIME_TO_SEC(TIMEDIFF(close_time, '00:00:00'))
        END
    ) / 3600 AS Average_Hours_Open  -- convert seconds to hours
FROM
    business_hours bh
INNER JOIN
    business b ON bh.business_id = b.business_id
INNER JOIN
    business_categories bc ON b.business_id = bc.business_id
WHERE
    b.city = 'Philadelphia'
    AND bc.business_category = 'Restaurants';

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
1 rows affected.

[(Decimal('9.98737838'),)]

## **Query 6: Restaurants with Most Check-Ins in Philadelphia**

Business meaning: A high number of check-ins typically indicates a restaurant's popularity and frequent patronage. It can signify that the establishment has a loyal customer base or that it's a hotspot for visitors or locals.

In [ ]:
%%sql
SELECT
    b.name AS Restaurant_Name,
    LENGTH(ch.date) - LENGTH(REPLACE(ch.date, ',', '')) + 1 AS Total_Checkins
FROM
    a09.business b
INNER JOIN
    a09.checkin ch ON b.business_id = ch.business_id
INNER JOIN
    business_categories bc ON b.business_id = bc.business_id
WHERE
    b.city = 'Philadelphia'
    AND bc.business_category = 'Restaurants'
ORDER BY
    Total_Checkins DESC
LIMIT 10;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
10 rows affected.

[('Lake Blue Sushi & Cuisine', 13),
 ('Smokes Poutinerie', 13),
 ('El Jarocho', 13),
 ('Hosteria Da Elio', 13),
 ('Nightmare Before Tinsel', 13),
 ('Say Cheese', 13),
 ('revive 21', 13),
 ('Falafel Time', 13),
 ("Amma's South Indian Cuisine", 13),
 ("Nick's Roast Beef", 13)]

## **Query 7: Top 5 Users Who Review Restaurants in Philadelphia (For Influencer Collaboration)**

Business meaning: These top reviewers likely have a significant influence in the local dining scene. Their reviews may sway potential customers' decisions, either positively or negatively. Recognizing these top reviewers can provide insights into which users are most engaged and active in the local food community.

In [ ]:
%%sql
SELECT
    r.user_id,
    COUNT(DISTINCT r.business_id) AS Reviewed_Restaurants_Count
FROM
    a09.review r
INNER JOIN
    a09.business b ON r.business_id = b.business_id
INNER JOIN
    a09.business_categories bc ON r.business_id = bc.business_id
WHERE
    b.city = 'Philadelphia'
    AND bc.business_category = 'Restaurants'
GROUP BY
    r.user_id
ORDER BY
    Reviewed_Restaurants_Count DESC
LIMIT 5;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
5 rows affected.

[('11xwVSDv1ytjcyvUiyBWaw', 1),
 ('2DOVDCbzd2X1cxs0YeFdrg', 1),
 ('4fuO9GqV6ldWqorzo6AbYA', 1),
 ('4KNOhaUhegpmZ6sWwJtRTw', 1),
 ('7ktyPHE-NGnWxarOqjIQiQ', 1)]

## **Query 8: Average Number of Tips Given to Restaurants in Philadelphia by category**

Business meaning: This query will provide insights into which restaurant categories encourage more customer engagement. A higher number of tips might suggest a more engaged and interactive customer base for that category.

In [ ]:
%%sql
SELECT
    bc.business_category,
    AVG(tip_count) AS Average_Tips
FROM
    a09.business b
LEFT JOIN
    (SELECT business_id, COUNT(*) AS tip_count FROM a09.tip GROUP BY business_id) AS t ON b.business_id = t.business_id
INNER JOIN
    a09.business_categories bc ON b.business_id = bc.business_id
WHERE
    b.city = 'Philadelphia' AND bc.business_category LIKE '%Restaurants%'
GROUP BY
    bc.business_category
ORDER BY
    Average_Tips DESC;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
4 rows affected.

[(' Restaurants', Decimal('17.7619')),
 ('Restaurants', Decimal('14.0246')),
 ('Pop-Up Restaurants', Decimal('3.6667')),
 (' Pop-Up Restaurants', Decimal('3.5000'))]

## **Query 9: Most tipped 10 restaurants in Philadelphia**

Business meaning: The most tipped restaurants likely receive a wealth of feedback from their customers. Analyzing this feedback can offer valuable insights into what the restaurant is doing right and where there might be room for improvement.

In [ ]:
%%sql
SELECT
    b.name AS Restaurant_Name,
    COUNT(t.business_id) AS NumberOfTips
FROM
    a09.business b
INNER JOIN
    a09.tip t ON b.business_id = t.business_id
WHERE
    b.city = 'Philadelphia'
GROUP BY
    b.name
ORDER BY
    NumberOfTips DESC
LIMIT 10;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
10 rows affected.

[('Philadelphia International Airport - PHL', 1011),
 ('Reading Terminal Market', 827),
 ('Starbucks', 688),
 ('Green Eggs Cafe', 591),
 ("Sabrina's Café", 499),
 ('Dalessandro’s Steaks & Hoagies', 460),
 ("Pat's King of Steaks", 400),
 ("Dunkin'", 393),
 ('Dim Sum Garden', 382),
 ('Han Dynasty', 380)]

## **Query 10: Display reviews for the 10 lowest-rated restaurants in Philadelphia**

In [ ]:
%%sql
WITH LowestRatedRestaurants AS (
    SELECT
        r.business_id,
        AVG(r.stars) AS avg_rating
    FROM
        a09.review r
    JOIN
        a09.business b ON r.business_id = b.business_id
    JOIN
        a09.business_categories bc ON b.business_id = bc.business_id
    WHERE
        b.city = 'Philadelphia' AND bc.business_category LIKE '%restaurants%'
    GROUP BY
        r.business_id
    ORDER BY
        avg_rating ASC
    LIMIT 10
)

SELECT
    r.business_id,
    r.review_id,
    r.user_id,
    r.stars,
    r.text
FROM
    a09.review r
JOIN
    LowestRatedRestaurants lr ON r.business_id = lr.business_id
ORDER BY
    lr.avg_rating ASC, r.date DESC;

 * mysql://A09:***@testproject.mysql.database.azure.com:3306/A09
11 rows affected.

[('C_EtrXTygRX5RTUOKtO6Dg', 'yFV9UnuTR3wqCVRwkeYGxA', 'tgZ0r69ap3_-sNBgLPZsPw', 1.0, "It's a good thing I've had a few weeks to cool off from my experience at Copabanana before writing this review or it might not have been pretty. Anyh ... (528 characters truncated) ... ck with chicken as I asked for and it was like biting into rubber bands. All in all it was a disaster and I'll never return. 1 star for the waitress."),
 ('04UD14gamNjLY0IDYVhHJg', 'JrIxlS1TzJ-iCu79ul40cQ', 'eUta8W_HdHMXPzLBBZhL1A', 1.0, "I am a long term frequent customer of this establishment. I just went in to order take out (3 apps) and was told they're too busy to do it. Really? T ... (43 characters truncated) ... our dick reach your ass? Yes? Go fuck yourself! I'm a frequent customer AND great tipper. Glad that Kanella just opened. NEVER going back to dmitris!"),
 ('r2cjbHG_WGWUkaPCbLpo-A', 'S79tU1cnlxnYhm8zfb8LyA', 'ybnpLuqHe1RCKfzqAGy8gg', 1.0, 'This place\'s posted hours include a 10PM closing time. \n\nI walked in at 8:30 and, as soon as I got to the counter, the guy said to me "kitchen\'s  ... (107 characters truncated) ...  is the door to your restaurant unlocked? \n\nSecondly, I could see this being the case if I walked in at, say, 9:55PM. But 8:30? That\'s ridiculous.'),
 ('-OIUunijjcq_ZzyyQhPPFQ', 'RC8D-iY19aZFHXUHaS8xLg', '11xwVSDv1ytjcyvUiyBWaw', 1.0, 'I got the gyro "platter" for lunch, which was dry, uninspired, and nothing like a deconstructed gyro. Worst of all, it came with "vegetables" which looked more like poop. Tasted that way, too. There are better places in Fairmount for lunch, and they won\'t serve you poop, either.'),
 ('kgMEBZG6rjkGeFzPaIM4MQ', 'E-yGr1OhsUBxNeUVLDVouA', 'MfDqmwzf1WxvJFtiRKi4Sg', 1.0, 'I know I shouldn\'t expect much but everything I asked for that was on the drive thru menu was not available. I was actually afraid of what I was goi ... (24 characters truncated) ...  it. I saw the movie "waiting".  Word of advice stay clear of this arch. Just so you know I was only trying to order a beverage how pathetic is that.'),
 ('kimOwpoIWzJJx7NHTAj74Q', 'Ci4-cJGw2rSEawQKaL0oTw', 'IoJCMMA9fNaSZ_WXGpnwbw', 1.0, 'Hated this place I went in to try an egg roll and get a sushi roll and both were bad the egg was horrible and the sushi was chewy so I wasnt surprised that I was the only one there'),
 ('CinrOH8rMB2hEvPY_iFOHA', 'hhNzXq6QnYQUYaBvFL8ggQ', '7ktyPHE-NGnWxarOqjIQiQ', 1.0, "I really wanted to like Casselli's, but it wasn't in the cards. Maybe I just caught them on a bad night, but I didn't really enjoy much about my visi ... (947 characters truncated) ... ms too high.\n\nOn the upside, they have somewhat convenient parking in the lot behind the restaurant (near the Shawmont School).\n\nNote: cash-only."),
 ('VbItL6RDULtnw4YvB6EhVg', 'y1CYqccQLsn8GGXYS4q6tQ', 'BmThnFPDalpbC1x98aXKaw', 1.0, "They served me a frozen pizza and skunked beer.  'Nuff said."),
 ('y44MbCvvtmg1FpkNGSWisw', '5wPq_FqKNx4NSdjW4MDCRQ', 'jHcTMCmyetM7HSC7weQTlg', 2.0, "Hate to be harsh but dang! After having a limited selection at terminal F I finally decided to go with Tony Luke's. I was looking forward in trying t ... (175 characters truncated) ...  of the sandwich. The part that got me even more was the meat. I don't know what it taste like to eat dog food, but I am sure I just paid $10 for it."),
 ('y44MbCvvtmg1FpkNGSWisw', 'pD3eUWVZh7BRrj-ldf4LoA', 'u3QY-afIktF3iUYHiKYT0g', 1.0, "Worst roast pork sandwich I've ever had. The broccoli rabe was lifeless and freezing. It was so cold my cheese didn't melt. The bread was soggy and wet. Horrible. If I wasn't in an airport, I'd bring this back."),
 ('FnEkr6LzjuGsg93Z7fkl7Q', 'dUkUiVjwb9xCF1kMqjT6nA', 'EDPlya2Sfu0teqreA3rlZw', 2.0, "Before I share the main issue, I want to share the reason I give any stars is because of our awesome server, LaToya. She was thoughtful and engaging! ... (1067 characters truncated) ... ttled. \n\nNo one needs to know why the arrest happened but there needed to be more care for customers and staff in how it was handled. \n\nNot ok!!!")]